<template>
  <div>
    <div class="black" />
    <div class="agreement-main">
      <div class="auto">
        <div class="agreement-container">
          <div class="agreement-box">
            <div class="agreement-content">
              <h2>CDN服务协议</h2>
              <p class="spec">
                <span class="strong">提示条款</span>
                <span>版本生效日期:2022年4月1日</span>
              </p>
              <p>欢迎您与{{ webInfo.websiteName }}(以下简称“{{ webInfo.title }}”)共同签署本《CDN服务协议》(下称“本协议”)并使用{{ webInfo.title }}服务！</p>
              <p>协议中条款前所列索引关键词仅为帮助您理解该条款表达的主旨之用，不影响或限制本协议条款的含义或解释。为维护您自身权益，建议您仔细阅读各条款具体表述。</p>
              <p>【审慎阅读】您在同意本协议之前，应当认真阅读本协议。请您务必审慎阅读、充分理解各条款的内容，特别是免除或者限制责任的条款、法律适用和争议解决条款，这些条款将以粗体下划线标识，您应重点阅读。如您对协议有任何疑问，可以向客服和相关业务部门进行咨询。</p>
              <p>【签约动作】当您阅读并点击同意本协议或以其他方式选择接受本协议后，即表示您已充分阅读、理解并接受本协议的全部内容，并与{{ webInfo.title }}达成一致。本协议自您通过网络页面点击确认或以其他方式选择接受本协议之日起成立。阅读本协议的过程中，如果您不同意本协议或其中任何条款约定，请勿进行签约动作</p>
              <p class="strong">通用服务条款</p>
              <p class="strong-two">1. 签约主体及协议范围</p>
              <p>本服务协议是您与{{ webInfo.websiteName }}就{{ webInfo.title }}服务所签署的服务协议。</p>
              <p class="strong-two">2. 服务内容</p>
              <p>2.1. 本协议中“服务”指：{{ webInfo.title }}{{ webInfo.internationalSiteAddress }}网站和客户端（以下单独或统称“{{ webInfo.title }}网站”）所展示的服务以及相关的技术及网络支持服务。</p>
              <p>2.2 在本协议中，如无特别指出，CDN指{{ webInfo.title }}的CDN服务、PCDN服务、安全加速（SCDN）、全站加速以及您订购且{{ webInfo.title }}同意向您提供其他服务及相关技术及网络支持服务。</p>
              <p>2.3 如无特殊说明，本合同中的带宽采用1000进制，如1Gbps=1000Mbps。流量采用1024进制，1TByte= 1024GByte。</p>
              <p>2.4 在业界标准的流量统计中，会在原有日志流量的基础上再加上7%-15%的网络消耗做为计费流量统计，我们取平均值10%做为网络消耗统计。</p>
              <p class="strong">3. 服务费用</p>
              <p>3.1. 服务费用将在您订购页面予以列明公示，您可自行选择具体服务类型并按列明的价格予以支付。您可选择先付费或后付费的服务。</p>
              <p class="strong-two">3.2. 先付费：</p>
              <p>3.2.1. 您可选择订购预付费以包年或包月形式售卖的CDN服务（流量包），就以包年包月形式售卖的CDN流量包，在您付费之后，{{ webInfo.title }}才开始为您提供服务。您未在下单后立即付费的，订单将为您保留7天，7天届满您仍未付费或者7天内{{ webInfo.title }}服务售罄的，订单失效，订单失效后{{ webInfo.title }}与您就服务所达成的合意失效。</p>
              <p>3.2.2. 服务期满双方愿意继续合作的，您至少应在服务期满前7天内支付续费款项，以使服务得以继续进行。</p>
              <p class="strong-two">3.3. 后付费：</p>
              <p>您可以选择以按量形式售卖的CDN服务，该等服务先使用后付费，您开通服务后，{{ webInfo.title }}即为您提供服务，{{ webInfo.title }}对您实际使用量进行计费并出具账单，并按照账单金额从您的{{ webInfo.title }}账户中划扣服务费用，具体扣费规则请查看{{ webInfo.title }}网站上的页面展示且以页面公布的后付费服务当时有效的计费模式和标准。您同意，后付费若进行保底消费承诺的，{{ webInfo.title }}将给予一定的价格优惠；如保底期限内达不到保底要求，或无法完成保底期限的，{{ webInfo.title }}有权根据您当月的实际使用量对应的{{ webInfo.title }}官网阶梯价向您收取费用。</p>
              <p>3.4. {{ webInfo.title }}保留在您未按照约定支付全部费用之前不向您提供服务和/或技术支持，或者终止服务和/或技术支持的权利。同时，{{ webInfo.title }}保留对您的欠费要求您按日承担万分之五的违约金以及追究其他法律责任的权利。</p>
              <p>3.5. 您完全理解{{ webInfo.title }}价格体系中所有的赠送服务项目或优惠活动均为{{ webInfo.title }}在正常服务价格之外的一次性特别优惠，赠送的服务项目或优惠活动不可折价、冲抵服务价格。</p>
              <p class="strong">4. 您的权利和义务</p>
              <p>4.1. 您同意遵守本服务条款以及服务展示页面的相关管理规范及流程。您了解上述协议及规范等的内容可能会不时变更。如本服务条款的任何内容发生变动，{{ webInfo.title }}应通过提前30天在{{ webInfo.internationalSiteAddress }} 的适当版面公告向您提示修改内容。如您不同意{{ webInfo.title }}对本服务条款相关条款所做的修改，您有权停止使用{{ webInfo.title }}的服务，此等情况下，本服务条款终止，{{ webInfo.title }}应与您进行服务费结算（如有）。如您继续使用{{ webInfo.title }}服务，则视为您接受{{ webInfo.title }}对本服务条款相关条款所做的修改。</p>
              <p>4.2. 您订购{{ webInfo.title }}的服务后，您可享受免费的售后服务。除此之外{{ webInfo.title }}并提供其他付费的技术服务。</p>
              <p>4.3. 您应按照{{ webInfo.title }}的网站页面提示及本服务协议的约定支付相应服务费用。</p>
              <p>4.4. 就{{ webInfo.title }}服务的使用应符合{{ webInfo.title }}的<a @click="skipServices">《服务使用规则》</a>以及本服务协议。</p>
              <p>4.5. 您对自己存放在{{ webInfo.title }}云平台上的数据以及进入和管理{{ webInfo.title }}云平台上各类产品与服务的口令、密码的完整性和保密性负责。因您维护不当或保密不当致使上述数据、口令、密码等丢失或泄漏所引起的损失和后果均由您承担。</p>
              <p>4.6. 您须依照《网络安全法》、《互联网信息服务管理办法》等法律法规的规定保留自己网站的访问日志记录，包括发布的信息内容及其发布时间、互联网地址（IP）、域名等，国家有关机关依法查询时应配合提供。您将承担未按规定保留相关记录而引起的相应法律责任。</p>
              <p>4.7. 为了数据的安全，您应负责您数据的备份工作。数据备份系您的义务和责任。{{ webInfo.title }}不备份用户数据，亦不对用户数据备份工作或结果承担任何责任。</p>
              <p>4.8. 您应对您的用户业务数据的来源及内容负责，{{ webInfo.title }}提示您谨慎判断数据来源及内容的合法性，包括但不限于各类数据、文档、图片、APP、小程序、网页、加密信息等。如数据来源和内容违反法律法规、部门规章或国家政策，{{ webInfo.title }}有权采取立即停止服务、终止协议等措施，同时您将承担因此而造成的相应结果及责任。</p>
              <p>4.9. 您理解并同意，中华人民共和国的国家秘密受法律保护，您有保守中华人民共和国的国家秘密的义务；您使用{{ webInfo.title }}服务应遵守相关保密法律法规的要求，并不得危害中华人民共和国国家秘密的安全。</p>
              <p>4.10. 您还应仔细阅读并遵守{{ webInfo.title }}在网站页面上展示的相应服务说明、技术规范、使用流程、操作文档等内容（以上简称“操作指引”），依照相关操作指引进行操作。您将承担违反相关操作指引所引起的后果；同时，{{ webInfo.title }}郑重提示您，请把握风险谨慎操作。</p>
              <p class="strong-two">4.11 您承诺：</p>
              <p>4.11.1. 如果您利用{{ webInfo.title }}提供的服务进行的经营活动需要获得国家有关部门的许可或批准的，应获得该有关的许可或批准。包括但不限于以下内容：</p>
              <p>如果您开办了多个网站，须保证所开办的全部网站均获得国家有关部门的许可或批准；</p>
              <p>如您网站提供非经营性互联网信息服务的，必须办理非经营性网站备案，并保证所提交的所有备案信息真实有效，在备案信息发生变化时及时在备案系统中提交更新信息；</p>
              <p>如您网站提供经营性互联网信息服务的，还应自行在当地通信管理部门取得经营性网站许可证；</p>
              <p>如您如提供BBS等电子公告服务的，也需根据相关法规政策要求备案或获得相应批准；</p>
              <p>如您经营互联网游戏网站的，您应依法获得网络文化经营许可证；</p>
              <p>如您经营互联网视频网站的，您应依法获得信息网络传播视听节目许可证；</p>
              <p>如您从事新闻、出版、教育、医疗保健、药品和医疗器械等互联网信息服务，依照法律、行政法规以及国家有关规定须经有关主管部门审核同意，在申请经营许可或者履行备案手续前，应当依法经有关主管部门审核同意。</p>
              <p>您理解并认可，以上列举并不能穷尽您进行经营或非经营活动需要获得国家有关部门的许可或批准的全部类型，您应获得有关的许可或批准，并应符合国家及地方不时颁布相关法律法规之要求。</p>
              <p>4.11.2. 除{{ webInfo.title }}明示许可外，不得修改、翻译、改编、出租、转许可、在信息网络上传播或转让{{ webInfo.title }}提供的软件，也不得逆向工程、反编译或试图以其他方式发现{{ webInfo.title }}提供的软件的源代码；</p>
              <p>4.11.3. 若{{ webInfo.title }}的服务涉及第三方软件之许可使用的，您同意遵守相关的许可协议的约束；</p>
              <p>4.11.4. 不散布电子邮件广告、垃圾邮件（SPAM）：不利用{{ webInfo.title }}提供的服务散发大量不受欢迎的或者未经请求的电子邮件、电子广告或包含反动、色情等有害信息的电子邮件；</p>
              <p>4.11.5. 不利用{{ webInfo.title }}提供的资源和服务上传（Upload）、下载（download）、储存、发布如下信息或者内容，不为他人发布该等信息提供任何便利（包括但不限于设置URL、BANNER链接等）:</p>
              <p>4.11.6. 违反国家规定的政治宣传和/或新闻信息；</p>
              <p>4.11.7. 涉及国家秘密和/或安全的信息；</p>
              <p>4.11.8. 封建迷信和/或淫秽、色情、下流的信息或教唆犯罪的信息；</p>
              <p>4.11.9. 博彩有奖、赌博游戏、“私服”、“外挂”等非法互联网出版活动；</p>
              <p>4.11.10. 违反国家民族和宗教政策的信息；</p>
              <p>4.11.11. 妨碍互联网运行安全的信息；</p>
              <p>4.11.12. 侵害他人合法权益的信息和/或其他有损于社会秩序、社会治安、公共道德的信息或内容；</p>
              <p>4.11.13. 其他违反法律法规、部门规章或国家政策的内容。</p>
              <p>4.11.14. 不应大量占用,亦不得导致如程序或进程等大量占用{{ webInfo.title }}云计算资源（如云服务器、网络带宽、存储空间等）所组成的平台（以下简称“云平台”）中服务器内存、CPU或者网络带宽资源，给{{ webInfo.title }}云平台或者{{ webInfo.title }}的其他用户的网络、服务器（包括但不限于本地及外地和国际的网络、服务器等）、产品/应用等带来严重的负荷，影响{{ webInfo.title }}与国际互联网或者{{ webInfo.title }}与特定网络、服务器及{{ webInfo.title }}内部的通畅联系，或者导致{{ webInfo.title }}云平台产品与服务或者{{ webInfo.title }}的其他用户网站所在的服务器宕机、死机或者用户基于云平台的产品/应用不可访问等；</p>
              <p>4.11.15. 不进行任何破坏或试图破坏网络安全的行为（包括但不限于钓鱼，黑客，网络诈骗，网站或空间中含有或涉嫌散播：病毒、木马、恶意代码，及通过虚拟服务器对其他网站、服务器进行涉嫌攻击行为如扫描、嗅探、ARP欺骗、DOS等）；</p>
              <p>4.11.16. 不进行任何改变或试图改变{{ webInfo.title }}提供的系统配置或破坏系统安全的行为；</p>
              <p>4.11.17. 不利用{{ webInfo.title }}提供的服务从事损害{{ webInfo.title }}、{{ webInfo.websiteName }}的关联公司、网站合法权益之行为，前述损害{{ webInfo.websiteName }}、网站合法权益的行为包括但不限于违反{{ webInfo.websiteName }}公布的任何服务协议/条款、管理规范、交易规则等规范内容、破坏或试图破坏{{ webInfo.websiteName }}公平交易环境或正常交易秩序等；</p>
              <p>4.11.18. 不从事其他违法、违规或违反{{ webInfo.title }}服务条款的行为；</p>
              <p>4.11.19. 如{{ webInfo.title }}发现您违反上述条款的约定，有权根据情况采取相应的处理措施，包括但不限于立即终止服务、中止服务或删除相应信息等。如果第三方机构或个人对您提出质疑或投诉，{{ webInfo.title }}将通知您，您有责任在规定时间内进行说明并出具证明材料，如您未能提供相反证据或您逾期未能反馈的，{{ webInfo.title }}将采取包括但不限于立即终止服务、中止服务或删除相应信息等处理措施。因您未及时更新联系方式或联系方式不正确而致使未能联系到您的，亦视为您逾期未能反馈。</p>
              <p>4.11.20. 您不应在{{ webInfo.title }}服务或平台之上安装、使用盗版软件；您对自己行为（如自行安装的软件和进行的操作）所引起的结果承担全部责任。</p>
              <p>4.12 您应向{{ webInfo.title }}提交执行本服务条款的联系人和管理用户网络及云平台上各类产品与服务的人员名单和联系方式并提供必要的协助。如以上人员发生变动，您应自行将变动后的信息进行在线更新并及时通知{{ webInfo.title }}。因您提供的人员的信息不真实、不准确、不完整，以及因以上人员的行为或不作为而产生的结果，均由您负责。</p>
              <p>4.13 您了解{{ webInfo.title }}CDN服务配置了安全防护的功能，同时，您了解{{ webInfo.title }}无法保证其所提供的服务毫无瑕疵（如{{ webInfo.title }}安全功能并不能保证您的硬件或软件的绝对安全），但{{ webInfo.title }}承诺不断提升服务质量及服务水平。所以您同意：即使{{ webInfo.title }}提供的服务存在瑕疵，但上述瑕疵是当时行业技术水平所无法避免的，其将不被视为{{ webInfo.title }}违约。您同意和{{ webInfo.title }}一同合作解决上述瑕疵问题。</p>
              <p>4.14. 您理解并确认，在CDN服务按流量计费模式下，您应在{{ webInfo.title }}规定的峰值带宽内使用流量（即使您为流量付费）。如您使用流量的峰值带宽超过{{ webInfo.title }}规定的峰值带宽，{{ webInfo.title }}有权根据自己的判断，对您的流量或峰值带宽进行限制或暂停提供服务，由此产生的直接或间接损失均由您自行承担。通过您和{{ webInfo.title }}的协商，如果您同意支付一定的费用，{{ webInfo.title }}可以在向您收取相应费用后取消对您的上述限制或暂停。</p>
              <p class="strong">5. {{ webInfo.title }}的权利、义务</p>
              <p>5.1. {{ webInfo.title }}应按照约定提供服务。</p>
              <p>5.2. 服务期限内，{{ webInfo.title }}将为您提供如下售后服务：</p>
              <p>5.2.1. {{ webInfo.title }}将提供7×24电话以及在线工单咨询服务，解答您在使用中的问题；</p>
              <p>5.2.2. {{ webInfo.title }}将为您提供故障支持服务，您应通过在线工单申报故障；{{ webInfo.title }}将及时就您非人为操作所出现的故障提供支持，但因您的人为原因和/或不可抗力、以及其他非{{ webInfo.title }}控制范围内的事项除外。</p>
              <p>5.3. 您还可通过{{ webInfo.title }}获得其他付费的售后服务，具体详见{{ webInfo.title }}的网站相关页面的收费售后服务内容。</p>
              <p>5.4. {{ webInfo.title }}仅负责操作系统以下的底层部分及{{ webInfo.title }}提供的软件的运营维护，即服务的相关技术架构及{{ webInfo.title }}提供的操作系统等。操作系统之上部分（如您在系统上安装的应用程序）由您负责。此外，您自行升级操作系统可能会造成宕机等不良影响，请把握风险并谨慎操作。</p>
              <p>5.5. 您了解{{ webInfo.title }}无法保证其所提供的服务毫无瑕疵（如{{ webInfo.title }}安全产品并不能保证您的硬件或软件的绝对安全），但{{ webInfo.title }}承诺不断提升服务质量及服务水平。所以您同意：即使{{ webInfo.title }}提供的服务存在瑕疵，但上述瑕疵是当时行业技术水平所无法避免的，其将不被视为{{ webInfo.title }}违约。您同意和{{ webInfo.title }}一同合作解决上述瑕疵问题。</p>
              <p>5.6. {{ webInfo.title }}的某些服务可能具备账户授权管理功能，即您可将您对服务的全部或部分操作权限授权给您指定的一个或多个被授权账户，此种情况下，任一被授权账户下进行的所有操作行为，均将被视为您通过本人账户所进行的行为，都将由您承担相应的责任和由此产生的服务费用。</p>
              <p>5.7. 您理解并认可，{{ webInfo.title }}将为您提供基于某些服务的安全防护（如“云盾安骑士服务”）以及管理与监控的相关功能及服务（如“云监控”），尽管{{ webInfo.title }}对该等服务经过详细的测试，但并不能保证其与所有的软硬件系统完全兼容，亦不能保证其软件及服务的完全准确性。如果出现不兼容及软件错误的情况，您应立即关闭或停止使用相关功能，并及时联系{{ webInfo.title }}，获得技术支持。</p>
              <p class="strong">6. 用户业务数据</p>
              <p>6.1. {{ webInfo.title }}理解并认可，您通过{{ webInfo.title }}提供的服务，加工、存储、上传、下载、分发以及通过其他方式处理的数据，均为您的用户业务数据，您完全拥有您的用户业务数据。</p>
              <p>6.2．就用户业务数据，{{ webInfo.title }}除执行您的服务要求外，不进行任何未获授权的使用及披露；但以下情形除外：</p>
              <p>6.2.1．在国家有关机关依法查询或调阅用户业务数据时，{{ webInfo.title }}具有按照相关法律法规或政策文件要求提供配合，并向第三方或者行政、司法等机构披露的义务；</p>
              <p>6.2.2．您和{{ webInfo.title }}另行协商一致。</p>
              <p>6.3． 您可自行对您的用户业务数据进行删除、更改等操作。如您释放服务或删除数据的，{{ webInfo.title }}将删除您的数据，按照您的指令不再保留该等数据。就数据的删除、更改等操作，您应谨慎操作。</p>
              <p>6.4. 当服务期届满、服务提前终止（包括双方协商一致提前终止，其他原因导致的提前终止等）或您发生欠费时，除法律法规明确规定、主管部门要求或双方另有约定外，{{ webInfo.title }}仅在一定的缓冲期（以您所订购的服务适用的专有条款、产品文档、服务说明等所载明的时限为准）内继续存储您的用户业务数据（如有），缓冲期届满{{ webInfo.title }}将删除所有用户业务数据，包括所有缓存或者备份的副本，不再保留您的任何用户业务数据。</p>
              <p>6.5. 用户业务数据一经删除，即不可恢复；您应承担数据因此被删除所引发的后果和责任，您理解并同意，{{ webInfo.title }}没有继续保留、导出或者返还用户业务数据的义务。</p>
              <p>6.6. 根据您与{{ webInfo.title }}协商一致，{{ webInfo.title }}在您选定的数据中心存储用户业务数据。{{ webInfo.title }}恪守对用户的安全承诺，根据适用的法律保护用户存储在{{ webInfo.title }}数据中心的数据。</p>
              <p class="strong">7. 知识产权</p>
              <p>7.1. 在本协议项下一方向对方提供的任何资料、技术或技术支持、软件、服务等的知识产权均属于提供一方或其合法权利人所有； 除提供方或合法权利人明示同意外，另一方无权复制、传播、转让、许可或提供他人使用上述知识成果，否则应承担相应的责任。</p>
              <p>7.2. 您应保证提交{{ webInfo.title }}的素材、对{{ webInfo.title }}服务的使用及使用{{ webInfo.title }}服务所产生的成果未侵犯任何第三方的合法权益。{{ webInfo.title }}应保证向您提供的服务未侵犯任何第三方的合法权益。</p>
              <p>7.3. 如果第三方机构或个人对您使用{{ webInfo.title }}服务所涉及的相关素材的知识产权归属提出质疑或投诉，或对您使用的{{ webInfo.title }}服务的知识产权的归属提出质疑或投诉，您和{{ webInfo.title }}均有责任出具相关知识产权证明材料，并配合对方的相关投诉处理工作。对于因此引起的索赔、诉讼或可能向其提起诉讼,违约方应负责解决，承担费用和损失，以及使另一方免责。</p>
              <p class="strong">8. 保密条款</p>
              <p>8.1．本服务条款所称保密信息，是指一方（以下简称“接受方”）从对方（以下简称“披露方”）取得的、获知的、或因双方履行本协议而产生的商业秘密（包括财务秘密）、技术秘密、经营诀窍和（或）其他应予保密的信息和资料（包括产品资料，产品计划，价格，财务及营销规划，业务战略，客户信息，客户数据，研发，软件，硬件，API应用数据接口，技术说明，设计，特殊公式，特殊算法等），无论上述信息和资料以何种形式或载于何种载体，无论披露方在披露时是否以口头、图像或书面等方式表明其具有保密性。</p>
              <p>8.2．双方应采取适当措施妥善保存对方提供的保密信息，措施的审慎程度不少于其保护自身的保密信息时的审慎程度。双方仅能将保密信息用于与本协议项下的有关用途或目的</p>
              <p>8.3．双方保证保密信息仅可在各自一方从事该业务的负责人和雇员范围内知悉，并严格限制接触上述保密信息的员工遵守本条之保密义务。</p>
              <p>8.4．本条上述限制条款不适用于以下情况：</p>
              <p>8.4.1．在签署本协议之时或之前，该保密信息已以合法方式属接受方所有；</p>
              <p>8.4.2．保密信息在通知给接受方时，已经公开或能从公开领域获得；</p>
              <p>8.4.3．保密信息是接受方从与其没有保密或不透露义务的第三方获得的；</p>
              <p>8.4.4．在不违反本协议约定责任的前提下，该保密信息已经公开或能从公开领域获得；</p>
              <p>8.4.5．该保密信息是接受方或其关联或附属公司独立开发，而且未从通知方或其关联或附属公司获得的信息中获益；</p>
              <p>8.4.6．接受方应法院或其它法律、行政管理部门要求（通过口头提问、询问、要求资料或文件、传唤、民事或刑事调查或其他程序）因而透露保密信息；</p>
              <p>8.4.7．接受方为向行政管理部门、行业协会等机构申请某项业务资质、获得某项认定、或符合国家、行业标准/认证，需结合对方情况向前述机构提交材料或进行说明的而披露的信息，在该等情况下，接受方应秉持必要情况下最少披露原则及要求因此获知保密信息的机构按不低于本协议的标准予以保密。</p>
              <p>8.5. 您和{{ webInfo.title }}都应尽最大的努力保护上述保密信息不被泄露。一旦发现有上述保密信息泄露事件，双方应合作采取一切合理措施避免或者减轻损害后果的产生。如因此给对方造成损失的，应赔偿因此给对方造成的直接经济损失。</p>
              <p class="strong">9. 服务的开通、终止与变更</p>
              <p class="strong-two">9.1. 先付费的服务：</p>
              <p>9.1.1. 您付费后服务即开通，开通后您获得{{ webInfo.title }}向您发送的登录、使用服务的密钥、口令即可使用服务，服务期限自开通之时起算（而非自您获得登录、使用服务的密钥、口令时起算）；</p>
              <p>9.1.2.以包年或包月形式售卖的CDN服务，您按照约定付款之后，{{ webInfo.title }}将为您提供您所订购的服务（套餐服务），服务期限自您支付成功之时起算，至您的套餐服务被消耗完毕或您订购的套餐期限届满为止（以二者早发生为准）。以按量形式售卖的CDN服务，您自开通之日起即可使用{{ webInfo.title }}的CDN服务。</p>
              <p>9.1.3. 您应在服务期限内将资源包的服务数量使用完毕，如资源包的服务期限届满，您已订购但未使用完毕的服务将被作废且{{ webInfo.title }}将不提供其他替代或补充。</p>
              <p>9.1.4. 您对于服务的使用将优先消耗订购的资源包，除法定及双方另行约定外，如资源包中的各项服务使用完毕或者服务期限到期，且您未继续订购资源包服务但持续使用此项服务的，{{ webInfo.title }}将视为您使用{{ webInfo.title }}以后付费形式售卖的该服务（如有），{{ webInfo.title }}将持续计费并根据计费结果予以扣划服务费用。</p>
              <p class="strong-two">9.2. 后付费的服务：</p>
              <p>除非另有其他约定或您未结清其他应付款项的，您开通服务即可使用{{ webInfo.title }}的服务；您应确保您的账户余额充足，以便持续使用服务至法律规定或本服务条款约定的终止情形出现时为止。</p>
              <p class="strong-two">9.3. 发生下列情形之一的，服务期限提前终止：</p>
              <p>9.3.2. 您严重违反本协议（包括，您严重违反相关法律法规规定，或您严重违反本协议项下之任一承诺内容等），{{ webInfo.title }}有权提前终止服务直至清除您的全部数据；</p>
              <p>9.3.3. 您理解并充分认可，虽然{{ webInfo.title }}已经建立（并将根据技术的发展不断完善）必要的技术措施来防御包括计算机病毒、网络入侵和攻击破坏（包括DDoS）等危害网络安全事项或行为（以下统称该等行为），但鉴于网络安全技术的局限性、相对性以及该等行为的不可预见性，因此如因您网站遭遇该等行为而给{{ webInfo.title }}或者{{ webInfo.title }}的其他网络或服务器（包括本地及外地和国际的网络、服务器等）带来危害，或影响{{ webInfo.title }}与国际互联网或者{{ webInfo.title }}与特定网络、服务器及{{ webInfo.title }}内部的通畅联系，{{ webInfo.title }}可决定暂停或终止服务。如果终止服务的，将按照实际提供服务月份计算（不足一个月的按天计）服务费用，将剩余款项（如有）返还。</p>
              <p>9.3.4. {{ webInfo.title }}可提前30天在{{ webInfo.title }}网站上通告或给您发网站内通知或书面通知的方式终止本服务服务协议；届时{{ webInfo.title }}应将您已预付但未消费的款项退还至您的{{ webInfo.title }}账户。</p>
              <p>9.4．您理解并认可，为技术升级、服务体系升级、或因经营策略调整或配合国家重大技术、法规政策等变化，{{ webInfo.title }}不保证永久的提供某种服务，并有权变更所提供服务的形式、规格或其他方面（如服务的价格和计费模式），在终止该种服务或进行此种变更前，{{ webInfo.title }}将尽最大努力且提前以网站公告、站内信、邮件或短信等一种或多种方式进行事先通知。</p>
              <p>9.5 您理解并充分认可，虽然{{ webInfo.title }}已经建立（并将根据技术的发展不断完善）必要的技术措施来防御包括计算机病毒、网络入侵和攻击破坏（包括但不限于DDOS）等危害网络安全事项或行为（以下统称该等行为），但鉴于网络安全技术的局限性、相对性以及该等行为的不可预见性，因此如因您网站遭遇该等行为而给{{ webInfo.title }}或者{{ webInfo.title }}的其他的网络或服务器（包括但不限于本地及外地和国际的网络、服务器等）带来危害，或影响{{ webInfo.title }}与国际互联网或者{{ webInfo.title }}与特定网络、服务器及{{ webInfo.title }}内部的通畅联系，{{ webInfo.title }}可决定暂停或终止服务。如果终止服务的，将按照实际提供服务计算服务费用，并且您仍应支付您尚未支付的服务费用（如有）。</p>
              <p>9.6 {{ webInfo.title }}可提前30天在{{ webInfo.internationalSiteAddress }}上通告或给您发网站内通知或书面通知的方式终止本服务条款。届时{{ webInfo.title }}应将您已支付但未消费的款项退还至您的{{ webInfo.title }}账户。</p>
              <p class="strong">10. 违约责任</p>
              <p>10.1．您违反本协议中的承诺、保证条款、服务使用规则或义务的任一内容，或{{ webInfo.title }}根据其判断认为您的使用行为存在异常的，{{ webInfo.title }}均有权就其情节，根据独立判断并单方采取以下措施中的一种或多种：（1）限制、中止使用服务；（2）终止提供服务，终止本协议；（3）追究您的法律责任；（4）其他{{ webInfo.title }}认为适合的处理措施。{{ webInfo.title }}依据前述约定采取中止服务、终止服务等措施而造成的用户损失将由您承担。</p>
              <p>10.2．如因您违反有关法律法规或者本协议、相关规则之规定，使{{ webInfo.title }}遭受任何损失、受到其他用户、任何第三方的索赔或任何行政管理部门的处罚，您应对{{ webInfo.title }}、其他用户或相关第三方的实际损失进行全额赔偿，包括合理的律师费用。</p>
              <p class="strong-two">10.3．您理解且同意，鉴于计算机、互联网的特殊性，下述情况不属于{{ webInfo.title }}违约：</p>
              <p>10.3.1. {{ webInfo.title }}在进行系统及服务器配置、维护、升级时，需要短时间中断服务；</p>
              <p>10.3.2. 由于Internet上的通路阻塞造成您网站访问速度下降。</p>
              <p>10.4．如果因{{ webInfo.title }}原因造成您连续72小时不能正常使用服务的，您可终止接受服务，但非{{ webInfo.title }}控制之内的原因引起的除外。</p>
              <p>10.5．在任何情况下，{{ webInfo.title }}均不对任何间接性、后果性、惩戒性、偶然性、特殊性的损害，包括您使用{{ webInfo.title }}服务而遭受的利润损失承担责任（即使您已被告知该等损失的可能性）。</p>
              <p>10.6. 在法律允许的情况下，{{ webInfo.title }}在本协议项下所承担的损失赔偿责任不超过就该服务过往12个月所缴纳的服务费用的总和。</p>
              <p class="strong">11.通知</p>
              <p>11.1. 您在使用{{ webInfo.title }}服务时，您应该向{{ webInfo.title }}提供真实有效的联系方式（包括您的电子邮件地址、联系电话、联系地址等），对于联系方式发生变更的，您有义务及时更新有关信息，并保持可被联系的状态。您接收站内信、系统消息的会员账号（包括子账号），也作为您的有效联系方式。</p>
              <p>11.2． {{ webInfo.title }}将向您的上述联系方式的其中之一或其中若干向您送达各类通知，而此类通知的内容可能对您的权利义务产生重大的有利或不利影响，请您务必及时关注。</p>
              <p>11.3. {{ webInfo.title }}通过上述联系方式向您发出通知，其中以电子的方式发出的书面通知，包括公告，向您提供的联系电话发送手机短信，向您提供的电子邮件地址发送电子邮件，向您的账号发送系统消息以及站内信信息，在发送成功后即视为送达；以纸质载体发出的书面通知，按照提供联系地址交邮后的第五个自然日即视为送达。</p>
              <p>11.4. 你应当保证所提供的联系方式是准确、有效的，并进行实时更新。如果因提供的联系方式不确切，或不及时告知变更后的联系方式，使法律文书无法送达或未及时送达，将由您承担由此可能产生的法律后果。</p>
              <p class="strong">12.不可抗力</p>
              <p>12.1. 因不可抗力或者其他意外事件，使得本服务条款的履行不可能、不必要或者无意义的，遭受不可抗力、意外事件的一方不承担责任。</p>
              <p>12.2. 不可抗力、意外事件是指不能预见、不能克服并不能避免且对一方或双方当事人造成重大影响的客观事件，包括自然灾害如洪水、地震、瘟疫流行等以及社会事件如战争、动乱、政府行为、电信主干线路中断、黑客、网路堵塞、电信部门技术调整和政府管制等。</p>
              <p class="strong">13. 法律适用及争议解决</p>
              <p>13.1. 本协议之订立、生效、解释、修订、补充、终止、执行与争议解决均适用中华人民共和国大陆法律；如法律无相关规定的，参照商业惯例及/或行业惯例。</p>
              <p>13.2. 您因使用{{ webInfo.title }}服务所产生及与{{ webInfo.title }}服务有关的争议，由{{ webInfo.title }}与您协商解决。协商不成时，任何一方均可向西湖区人民法院提起诉讼。</p>
              <p class="strong">14. 附则</p>
              <p>14.1．本协议的附件，以及{{ webInfo.title }}在{{ webInfo.title }}网站相关页面上的服务说明、价格说明和您确认同意的订购页面（包括产品的专用条款、服务说明、操作文档等）均为本协议不可分割的一部分。如遇不一致之处，以（1）服务说明、价格说明、其他订购页面，（2）专用条款和附件，（3）本协议通用条款的顺序予以适用。</p>
              <p>14.2. {{ webInfo.title }}有权以提前30天在{{ webInfo.internationalSiteAddress }}上公布、或给您发网站内通知或书面通知的方式将本服务条款的权利义务全部或者部分转移给{{ webInfo.title }}的关联公司。</p>
              <p>14.3. {{ webInfo.title }}于您过失或违约时放弃本协议规定的权利，不应视为其对您的其他或以后同类之过失或违约行为弃权。</p>
              <p>14.4. 本协议任一条款被视为废止、无效或不可执行，该条应视为可分的且并不影响本协议其余条款的有效性及可执行性。</p>
              <p>14.5. 本协议项下之保证条款、保密条款、知识产权条款、法律适用及争议解决条款等内容，不因本协议的终止而失效。</p>
              <p class="strong">专用服务条款</p>
              <p>1. 【CDN服务】</p>
              <p class="strong-two">1.1. 欠费停服</p>
              <p>1.1.1.就按量付费的服务，您应保持账户余额等扣款渠道金额充足，以确保服务的持续使用。若您的的账户余额等扣款渠道余额不足导致服务欠费的，{{ webInfo.title }}将暂停提供按量付费服务。</p>
              <p>您可以在“控制台”自助申请开通延期免停权益，{{ webInfo.title }}将提供一定的延停额度/或延停时长（“延停权益”），在延停额度/或延停时长期内（“延期停服期间”）内仍可继续使用{{ webInfo.title }}相关服务，并应按正常费用标准缴纳服务费用，延期停服期满您仍未付清所欠服务费用的，{{ webInfo.title }}将暂停提供按量付费服务、冻结您账号下的相关操作（延停额度是否已经用完以出帐后的账单显示为判断依据）。您享有的延停权益，由{{ webInfo.title }}根据您的消费情况、信用状况等综合评定并适时调整，以您“控制台”的实际展示为准（延停额度是否已经用完以出帐后的账单展示为判断依据）。您也可自行关闭延停额度或通过{{ webInfo.title }}工作人员关闭延停时长，您关闭延停权益的，{{ webInfo.title }}将自您欠费且关闭延停权益之时起暂停按量付费服务。</p>
              <p>自{{ webInfo.title }}暂停服务之日起一定期限内（“宽限期”），{{ webInfo.title }}仍将存储您的数据，并持续计算存储费用；宽限期满，您仍未支付所欠服务费用的，您保存在{{ webInfo.title }}的全部数据将会被删除并清空且用不可恢复。</p>
              <p>1.1.2. 就按套餐包形式售卖的服务，服务期届满，您将不能继续使用套餐包的服务；如您继续使用{{ webInfo.title }}服务的，{{ webInfo.title }}将视为您使用按量付费的服务，并持续计费。</p>
              <p>1.2. 以预付费套餐 + 超出套餐部分后付费(按日结算)结算的服务，如果预付费套餐未到期，但是超出套餐部分部分的费用导致了账户欠费，{{ webInfo.title }}将立即停止提供服务，直至您补齐欠款后恢复服务。</p>
              <p>1.3. 您理解并充分认可，虽然{{ webInfo.title }}已经建立（并将根据技术的发展不断完善）必要的技术措施来防御包括计算机病毒、网络入侵和攻击破坏（包括但不限于DDOS）等危害网络安全事项或行为（以下统称该等行为），但鉴于网络安全技术的局限性、相对性以及该等行为的不可预见性，因此如因您网站遭遇该等行为而给{{ webInfo.title }}或者{{ webInfo.title }}的其他的网络或服务器（包括但不限于本地及外地和国际的网络、服务器等）带来危害，或影响{{ webInfo.title }}与国际互联网或者{{ webInfo.title }}与特定网络、服务器及{{ webInfo.title }}内部的通畅联系，{{ webInfo.title }}可决定暂停或终止服务。如果终止服务的，将按照实际提供服务计算服务费用，并且您仍应支付您尚未支付的服务费用（如有）。</p>
              <p>1.4. 就您购买的CDN服务，{{ webInfo.title }}承诺按照{{ webInfo.title }}在官网上公布各服务的<a @click="skipLevel">服务等级协议</a>提供服务，如CDN服务按照</p>
              <p>1.5. 符合以下情况之一的都属于“突发带宽”：</p>
              <p>a.带宽计费/流量计费客户：本自然月带宽增量超过500Gbps，或上个自然月带宽峰值为0，本自然月带宽增量超过200Gbps；不符合上述标准，但本自然月的带宽增量超出上月计费带宽的30%（另有约定的，从其约定）；</p>
              <p>b.流量计费客户：本自然月的带宽峰值超过10Gbps。</p>
              <p>如果您对CDN服务有突发带宽使用需求，您需提前至少3个工作日（重大节日的突发，包括但不限于春晚，双十一等，需要提前至少1个月）联系{{ webInfo.title }}申请突发带宽用量。若申请成功，在双方约定的突发量级内，可确保您的服务不受影响；若申请不成功或未申请的，则对于突发带宽，{{ webInfo.title }}有权采取限流等措施来保障全网用户的稳定性，由此导致的可用性问题，{{ webInfo.title }}不承担责任。</p>
              <p>如您需申请突发带宽用量，具体请联系{{ webInfo.title }}商务洽谈。申请成功的，{{ webInfo.title }}将按照与您重新商定的价格标准进行计费；申请不成功或未申请的，{{ webInfo.title }}将按照您当前的价格标准进行计费，详细费用最终以CDN账单为准。</p>
            </div>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
import { mapState } from 'vuex'

export default {
  computed: {
    ...mapState({
      webInfo: state => state.home.webInfo
    })
  },
  // eslint-disable-next-line vue/order-in-components
  data () {
    return {
      url: ''
    }
  },
  mounted () {
    console.log(this.webInfo, "666666666666")
    this.url = this.getUrl()
  },
  methods: {
    getUrl () {
      return window.location.protocol + '//' + window.location.host
    },
    skipServices(){
      this.$router.push({
        path:"/service-rules"
      })
    },
    skipLevel(){
      this.$router.push({
        path:"/service-level"
      })
      
    }
  }
}
</script>

<style lang="scss" scoped>
p {
  line-height: 26px;
}
.black {
  height: 80px;
  background-color: black;
}
.agreement-main {
  width: 100%;
  margin-bottom: 30px;
  margin-top: 10px;
  .auto {
    margin: 0 auto;
    min-width: 1220px;
    max-width: 1220px;
    .agreement-container {
      padding-top: 30px;
      overflow: auto;
      .agreement-box {
        border: 1px solid #e5e5e5;
        margin-top: 10px;
        .agreement-content {
          padding: 20px 30px;
          h2 {
            padding-bottom: 20px;
            font-size: 24px;
            color: #333;
            text-align: center;
            border-bottom: 1px solid #ddd;
          }
          .spec {
            text-indent: 0;
            padding: 0;
            display: flex;
            justify-content: space-between;
          }
          p {
            // padding-top: 1em;
            text-indent: 0;
          }
          .pad-l-2em {
            padding-left: 4em;
          }
          .pad-l-4em {
            padding-left: 6em;
          }
        }
      }
    }
  }
}
.strong {
            font-size: 16px;
            font-weight: 600;
          }
.strong-two{
  // color: red;
}
</style>
